md1 = r'''基本边界值测试用例13个

year(2000-2100)的基本边界（最小值，略高于最小值、正常值、略低于最大值和最大值）分别为:  2000, 2001, 2020, 2099, 2100

Month的基本边界（最小值，略高于最小值、正常值、略低于最大值和最大值）: 1(31),  2(28/29), 6(30), 11(30),  12(31)

Day的基本边界（最小值，略高于最小值、正常值、略低于最大值和最大值）: 1, 2, 14, 30, 31'''


md2 = r'''健壮性边界测试用例：6个

D的健壮性边界（略小于最小值，略超过最大值）: 0, 29

M的健壮性边界（略小于最小值，略超过最大值）: 0, 13

 Y的健壮性边界（略小于最小值，略超过最大值）:  -1，1999, 2101'''


md3 = r'''考虑到一些跨年和平闰年2月天数的特殊性，增加了一些额外补充测试用例：5个'''


md4 = r'''有效等价类：

year：{year = 平年}，{year = 闰年}

month：{month = 31日月}，{month = 30日月}，{month = 2月}

day:{1<=day<=28}，{day = 29}，{day = 30}，{day = 31}

无效等价类：

year：{year < 1}，{year > 2100}

month：{month < 1}, {month  > 12}

day: {day < 1}, {day > 31}

强一般等价类测试用例 24个'''


md5 = r'''额外弱健壮部分的测试用例：6个'''
