statement = r'''每个可执行程序语句至少执行一次

   S1（语句1）：销售额大于200万且请假天数不超过10天

   S2（语句2）：现金到帐大于等于60%

   S3（语句3）：输出佣金0

   S4（语句4）：输出佣金=销售额/7

   S5（语句5）：现金到帐小于等于85%

   S6（语句6）：输出出佣金=销售额/5

   S7（语句7）：出佣金=销售额/6

   | 测试用例 | S    | CR   | LD   | commission | 覆盖语句   |
   | -------- | ---- | ---- | ---- | ---------- | ---------- |
   | 1        | 200  | 85%  | 9    | 33.33      | S1, S5, S7 |
   | 2        | 200  | 90%  | 9    | 40         | S1, S5, S6 |
   | 3        | 300  | 60%  | 9    | 42.85      | S1, S2, S4 |
   | 4        | 300  | 55%  | 9    | 0          | S1, S2, S3 |'''


branch = r'''每个判断取真和假至少一次

   判断一：销售额大于200万且请假天数不超过10天，真记为 T1，假记为F1

   判断二：现金到帐大于等于60%，真记为 T2，假记为F2

   判断三：现金到帐小于等于85%，真记为 T3，假记为F3

   | 测试用例 | S    | CR   | LD   | commission | 覆盖判断 |
   | -------- | ---- | ---- | ---- | ---------- | -------- |
   | 1        | 200  | 85%  | 9    | 33.33      | F1, T3   |
   | 2        | 200  | 90%  | 9    | 40         | F1, F3   |
   | 3        | 300  | 60%  | 9    | 42.85      | T1, T2   |
   | 4        | 300  | 55%  | 9    | 0          | T1, F2   |'''


condition = r'''每个判断中的每个条件的可能取值至少满足一次

   第一个判断销售额大于200万且请假天数不超过10天：

   + S>200 记T1；S<=200 记F1

   + LD <= 10 记 T2; LD > 10 记 F2

   第二个判断现金到帐大于等于60%：

   + CR >=60%, 记 T3;  CR <60%, 记 F3

   第三个判断现金到帐小于等于85%：
   
   + CR <=85%, 记T4; CR >85%, 记 F4

| 测试用例 | S    | CR   | LD   | commission | 覆盖条件   |
| -------- | ---- | ---- | ---- | ---------- | ---------- |
| 1        | 300  | 55%  | 10   | 0          | T1, T2     |
| 2        | 300  | 85%  | 11   | 50         | T1, F2, T4 |
| 3        | 200  | 90%  | 9    | 40         | F1, F4     |
| 4        | 300  | 60%  | 9    | 42.85      | T1, T2, T3 |'''


condition_determination = r'''每个判断中的每个条件的可能取值至少满足一次，且每个判断取真和假至少一次

   判断一：销售额大于200万且请假天数不超过10天，真记为 T5，假记为F5

   判断二：现金到帐大于等于60%，真记为 T6，假记为F6

   判断三：现金到帐小于等于85%，真记为 T7，假记为F7

   | 测试用例 | S    | CR   | LD   | commission | 覆盖条件   | 覆盖判断 |
   | -------- | ---- | ---- | ---- | ---------- | ---------- | -------- |
   | 1        | 300  | 55%  | 10   | 0          | T1, T2, F3 | T5, F6   |
   | 2        | 300  | 85%  | 11   | 50         | T1, F2, T4 | F5, T7   |
   | 3        | 200  | 90%  | 9    | 40         | F1, F4     | F5, F7   |
   | 4        | 300  | 60%  | 9    | 42.85      | T1, T2, T3 | T5, T6   |'''


multiple_condition = r'''每个判断的所有可能的条件取值组合至少一次

   条件组合有：

   1）S>200,LD <= 10, 记为 T1,T2

   2）S<=200,LD <= 10, 记为 F1,T2

   3）S>200,LD >10, 记为 T1,F2

   4）S<=200,LD > 10, 记为 F1,F2

   5) CR >=60%, 记为T3

   6) CR <60%, 记为F3

   7) CR >85%, 记为T4

   8）CR =< 85%, 记为F4

| 测试用例 | S    | CR   | LD   | 覆盖组合号 | 覆盖条件  |
| -------- | ---- | ---- | ---- | ---------- | --------- |
| 1        | 200  | 80%  | 9    | 2 8        | F1,T2, F4 |
| 2        | 300  | 65%  | 9    | 1 5        | T1,T2,T3  |
| 3        | 200  | 90%  | 11   | 4 7        | F1,F2,T4  |
| 4        | 300  | 55%  | 11   | 3 6        | T1,F2,F3  |'''
